



//1. Вывести через промт число равное 10% от введенного числа
let num = prompt ("введите Ваше число")  
 console.log("результат=" + num*0,1)


// //2. Два числа и выводит наименьшее

// let num1 = prompt ("ВВедите первое число")
// let num2 = prompt ("ВВедите второе число")
//     if (num1 < num2) {console.log(num1)} 
//     else if (num1 = num2)
//     {console.log("числа равны")}
    

// //3. Выводит одно из сообщений: больше меньше или равно 100

// let num = +prompt("введите Ваше число") 
//     if (num === 100) {console.log("число равно 100")} 
//     else if (num < 100) {console.log("число меньше 100")}
//     if (num > 100) {console.log("число больше 100")}


// //4. Запрашивает имя пользователя и возраст в годах. 
//если совершеннолетний то хэллоу нэйм, если нет - хай нэйм

// let num1 = prompt("Ваше имя")
// let num2 = prompt("Ваш возраст, полных лет") 
//     if(num2 > 18) {console.log("Hello, " + num1)} 
//     else if(num2 < 18) {console.log("Hi, " + num1)}
